Repository: Almanex/SnapIcon
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: de_de, ru_ru

# AppSubtitle.Text
source: Batch icon generator for Windows and Android
de_de: Batch-Icon-Generator für Windows und Android
ru_ru: Пакетный генератор иконок для Windows и Android

# SourceFileHeader.Text
source: Source File
de_de: Quelldatei
ru_ru: Исходный файл

# DropZoneText.Text
source: Drag and drop file here
de_de: Datei hierher ziehen
ru_ru: Перетащите файл сюда

# DropZoneSubtext.Text
source: PNG and SVG files are supported
de_de: PNG- und SVG-Dateien werden unterstützt
ru_ru: Поддерживаются файлы PNG и SVG

# BrowseButton.Content
source: Browse file on disk...
de_de: Datei auf der Festplatte auswählen...
ru_ru: Выбрать файл на диске...

# OutputDirHeader.Text
source: Destination Folder
de_de: Zielordner
ru_ru: Папка назначения

# OutputDirTextBox.PlaceholderText
source: Select folder to save icons
de_de: Ordner zum Speichern von Icons auswählen
ru_ru: Выберите папку для сохранения иконок

# BrowseFolderButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Select Folder
de_de: Ordner auswählen
ru_ru: Выбрать папку

# AndroidSettingsHeader.Text
source: Android Settings
de_de: Android-Einstellungen
ru_ru: Настройки Android

# AndroidBgColorText.Text
source: Adaptive icon background color
de_de: Hintergrundfarbe des adaptiven Icons
ru_ru: Цвет заднего фона адаптивной иконки

# QuickColorsText.Text
source: Quick colors:
de_de: Schnellfarben:
ru_ru: Быстрые цвета:

# UseBgImageCheckBox.Content
source: Use background image
de_de: Hintergrundbild verwenden
ru_ru: Использовать фоновое изображение

# BgImagePathTextBox.PlaceholderText
source: Background image file
de_de: Hintergrundbilddatei
ru_ru: Файл изображения для фона

# ExportParamsHeader.Text
source: Export Parameters
de_de: Export-Parameter
ru_ru: Параметры экспорта

# WindowsIcoCheckBox.Content
source: Windows (Classic .ico)
de_de: Windows (Klassisches .ico)
ru_ru: Windows (Классический .ico)

# WindowsIcoSubtext.Text
source: Multi-format container (16-256px) with micro-sharpening for small sizes.
de_de: Multiformat-Container (16-256px) mit Mikroschärfung für kleine Größen.
ru_ru: Мультиформатный контейнер (16-256px) с микро-шарпингом для мелких размеров.

# WindowsAssetsSubtext.Text
source: Separate PNG logos at scales from 100% to 400% for UWP/WinUI manifests.
de_de: Separate PNG-Logos in Skalierungen von 100% bis 400% für UWP/WinUI-Manifeste.
ru_ru: Раздельные PNG логотипы в масштабах от 100% до 400% для UWP/WinUI манифестов.

# AndroidAdaptiveSubtext.Text
source: Cutting Foreground, Background layers by MIPMAP densities, legacy circle and Google Play 512x512.
de_de: Zuschneiden von Vorder- und Hintergrundebenen nach MIPMAP-Dichten, Legacy-Kreis und Google Play 512x512.
ru_ru: Нарезка слоев Foreground, Background по MIPMAP плотностям, legacy-круг и Google Play 512x512.

# SysIntegrationHeader.Text
source: System Integration
ru_ru: Системная интеграция

# ContextMenuToggle.Header
source: Windows Context Menu
de_de: Windows-Kontextmenü
ru_ru: Контекстное меню Windows

# ContextMenuSubtext.Text
source: Add 'Generate icons in IconForge' to Explorer context menu (Win11: Shift+F10 / Show more options)
de_de: Eintrag 'Icons in IconForge generieren' zum Explorer-Kontextmenü hinzufügen (Win11: Shift+F10 / Weitere Optionen anzeigen)
ru_ru: Добавить пункт 'Сгенерировать иконки в IconForge' в контекстное меню Explorer (Win11: Shift+F10 / Показать доп. параметры)

# ProgressIdleText.Text
source: Waiting...
de_de: Bereit...
ru_ru: Ожидание...

# GenerateButton.Content
source: Generate Icons
de_de: Symbole generieren
ru_ru: Сгенерировать иконки

# ErrorUnsupportedFormatTitle
source: Format Not Supported
de_de: Format nicht unterstützt
ru_ru: Формат не поддерживается

# ErrorUnsupportedFormatMessage
source: IconForge only supports PNG and SVG files as source.
de_de: IconForge unterstützt nur PNG- und SVG-Dateien als Quelle.
ru_ru: IconForge поддерживает только файлы PNG и SVG в качестве источника.

# FileTypeSvg
source: SVG Vector Image
de_de: SVG-Vektorgrafik
ru_ru: Векторное изображение SVG

# FileTypePng
source: PNG Raster Image
de_de: PNG-Rastergrafik
ru_ru: Растровое изображение PNG

# FileSizeMb
source: Size: {0:F2} MB
de_de: Größe: {0:F2} MB
ru_ru: Размер: {0:F2} МБ

# FileSizeKb
source: Size: {0:F1} KB
de_de: Größe: {0:F1} KB
ru_ru: Размер: {0:F1} КБ

# FileSizeUnknown
source: Size: unknown
de_de: Größe: unbekannt
ru_ru: Размер: неизвестно

# ErrorIntegrationTitle
source: Integration Error
de_de: Integrationsfehler
ru_ru: Ошибка интеграции

# ErrorIntegrationMessage
source: Failed to change Explorer parameters: {0}
de_de: Explorer-Parameter konnten nicht geändert werden: {0}
ru_ru: Не удалось изменить параметры проводника: {0}

# ErrorNoFileTitle
source: File Not Selected
de_de: Keine Datei ausgewählt
ru_ru: Файл не выбран

# ErrorNoFileMessage
source: Please select a source PNG or SVG file.
de_de: Bitte wählen Sie eine PNG- oder SVG-Quelldatei aus.
ru_ru: Пожалуйста, выберите исходный PNG или SVG файл.

# ErrorNoOutputDirTitle
source: Destination Folder
de_de: Zielordner
ru_ru: Папка назначения

# ErrorNoOutputDirMessage
source: Please specify a folder to save icons.
de_de: Bitte geben Sie einen Ordner zum Speichern von Icons an.
ru_ru: Пожалуйста, укажите папку для сохранения иконок.

# ErrorNoParamsTitle
source: Generation Parameters
de_de: Generierungsparameter
ru_ru: Параметры генерации

# ErrorNoParamsMessage
source: You must select at least one icon type for generation.
de_de: Sie müssen mindestens einen Symboltyp für die Generierung auswählen.
ru_ru: Необходимо выбрать хотя бы один тип иконок для генерации.

# ToastTitle
source: Generation Complete
de_de: Generierung abgeschlossen
ru_ru: Генерация завершена

# ToastMessage
source: The icon pack has been successfully saved to the selected folder.
de_de: Das Icon-Paket wurde erfolgreich im ausgewählten Ordner gespeichert.
ru_ru: Пакет иконок успешно сохранен в выбранную папку.

# ToastButtonText
source: Open Folder
de_de: Ordner öffnen
ru_ru: Открыть папку

# ErrorGenerationTitle
source: Generation Error
de_de: Generierungsfehler
ru_ru: Ошибка генерации

# SuccessMessage
source: Successfully completed in {0:F1} ms!
de_de: Erfolgreich abgeschlossen in {0:F1} ms!
ru_ru: Успешно завершено за {0:F1} мс!

# PresetHeader.Text
source: Quick Presets
de_de: Schnellprofile
ru_ru: Быстрые пресеты

# PresetCustom.Content
source: Custom
de_de: Benutzerdefiniert
ru_ru: Пользовательский

# PresetWindows.Content
source: Windows App
ru_ru: Windows Приложение

# PresetRounded.Content
source: Rounded Icon
de_de: Abgerundetes Icon
ru_ru: Скругленная иконка

# FiltersHeader.Text
source: Image Filters & Color
de_de: Bildfilter & Farbkorrektur
ru_ru: Фильтры и коррекция цвета

# BrightnessLabel.Text
source: Brightness
de_de: Helligkeit
ru_ru: Яркость

# ContrastLabel.Text
source: Contrast
de_de: Kontrast
ru_ru: Контраст

# GrayscaleLabel.Content
source: Grayscale Mode
de_de: Graustufenmodus
ru_ru: Черно-белый режим (Grayscale)

# InvertLabel.Content
source: Invert Colors
de_de: Farben umkehren
ru_ru: Инверсия цветов

# TintColorLabel.Text
source: Color Tint (SVG)
de_de: Farbton (SVG Tint)
ru_ru: Цветовой оттенок (SVG Tint)

# ExportWebFaviconLabel.Content
source: Web & Favicon Pack (ico, png, manifest)
de_de: Web & Favicon Paket (ico, png, manifest)
ru_ru: Пакет Web & Favicon (ico, png, manifest)

# ExportMacIcnsLabel.Content
source: macOS App Icon (.icns)
ru_ru: Иконка macOS (.icns)

# PreviewGridHeader.Text
source: Multi-Size Live Preview
de_de: Live-Vorschau in verschiedenen Größen
ru_ru: Предпросмотр по размерам

# CornerRadiusLabel.Text
source: Corner Radius (%)
de_de: Eckenabrundung (%)
ru_ru: Скругление (%)

# PaddingLabel.Text
source: Padding (%)
de_de: Innenabstand (%)
ru_ru: Отступ (%)

# DropShadowLabel.Content
source: Drop Shadow
de_de: Schlagschatten (Drop Shadow)
ru_ru: Тень (Drop Shadow)

# TintColorTextBox.PlaceholderText
source: Hex #RRGGBB (optional)
ru_ru: Hex #RRGGBB (опционально)

# AboutBtnText.Text
source: About
de_de: Über
ru_ru: О программе

# AboutTitle
source: About IconForge
de_de: Über IconForge
ru_ru: О программе IconForge

# AboutVersion
source: Version 1.0.3 (WinUI 3 / .NET 10)
ru_ru: Версия 1.0.3 (WinUI 3 / .NET 10)

# AboutDescription
source: Native multi-format icon package generator for Windows, Web, macOS, and Android.
de_de: Nativer Multiformat-Icon-Paket-Generator für Windows, Web, macOS und Android.
ru_ru: Нативный мультиформатный генератор иконных пакетов для Windows, Web, macOS и Android.

# AboutAuthor
source: Developer: Almanex
de_de: Entwickler: Almanex
ru_ru: Разработчик: Almanex

# ContextMenuItemTitle
source: Generate icons in IconForge
de_de: Icons in IconForge generieren
ru_ru: Сгенерировать иконки в IconForge

# WindowsAssetsCheckBox.Content
source: Windows Assets (Square PNGs)
de_de: Windows-Assets (Quadratische PNGs)

# PresetWebFavicon.Content
source: Web & Favicon Pack
de_de: Web & Favicon Paket
